In [49]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [7]:
df = DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['1','2','3','4','5'])

In [8]:
df

          1         2         3         4         5
A  1.040392  0.976144 -0.255172 -0.606359 -0.416834
B  1.515899  1.698403  1.719118  1.491647 -0.269213
D -1.375428 -0.403549  0.352553  0.928223  0.383128
E  0.459672 -0.357216 -0.188965  0.767178 -0.600471
F -1.930981 -0.990988 -0.544210 -0.067622 -1.095519

In [17]:
new_index = ['A','B','C','D','E','F']

In [18]:
df2 = df.reindex(new_index)
df2

          1         2         3         4         5
A  1.040392  0.976144 -0.255172 -0.606359 -0.416834
B  1.515899  1.698403  1.719118  1.491647 -0.269213
C       NaN       NaN       NaN       NaN       NaN
D -1.375428 -0.403549  0.352553  0.928223  0.383128
E  0.459672 -0.357216 -0.188965  0.767178 -0.600471
F -1.930981 -0.990988 -0.544210 -0.067622 -1.095519

In [19]:
new_columns = ['1','2','3','4','5','6']
df2.reindex(columns=new_columns)

          1         2         3         4         5   6
A  1.040392  0.976144 -0.255172 -0.606359 -0.416834 NaN
B  1.515899  1.698403  1.719118  1.491647 -0.269213 NaN
C       NaN       NaN       NaN       NaN       NaN NaN
D -1.375428 -0.403549  0.352553  0.928223  0.383128 NaN
E  0.459672 -0.357216 -0.188965  0.767178 -0.600471 NaN
F -1.930981 -0.990988 -0.544210 -0.067622 -1.095519 NaN

In [12]:
df2

    1   2   3   4   5   6
A NaN NaN NaN NaN NaN NaN
B NaN NaN NaN NaN NaN NaN
C NaN NaN NaN NaN NaN NaN
D NaN NaN NaN NaN NaN NaN
E NaN NaN NaN NaN NaN NaN
F NaN NaN NaN NaN NaN NaN

# 欠損値の扱い

## Series

In [21]:
d = Series([1,2, np.nan, 3])
d

0    1.0
1    2.0
2    NaN
3    3.0
dtype: float64

In [22]:
d.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [23]:
d.dropna()

0    1.0
1    2.0
3    3.0
dtype: float64

In [24]:
d

0    1.0
1    2.0
2    NaN
3    3.0
dtype: float64

## DataFrame

In [27]:
df = DataFrame([[1,2,3],[5,np.nan,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
df

     0    1    2
0  1.0  2.0  3.0
1  5.0  NaN  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [28]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [29]:
df.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  5.0  NaN  6.0
2  7.0  NaN  9.0

In [30]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [33]:
df.fillna(1)

     0    1    2
0  1.0  2.0  3.0
1  5.0  1.0  6.0
2  7.0  1.0  9.0
3  1.0  1.0  1.0

In [70]:
df1=DataFrame([[np.nan,2,3],[np.nan,5,6],[np.nan,8,9]],index=['a','b','c'])
df1

    0  1  2
a NaN  2  3
b NaN  5  6
c NaN  8  9

In [71]:
df1.dropna()

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [72]:
df1.dropna(how='all')

    0  1  2
a NaN  2  3
b NaN  5  6
c NaN  8  9

In [84]:
df1.dropna(how='all')

    0    1  2
a NaN  2.0  3
b NaN  NaN  6
c NaN  8.0  9

In [85]:
df1.fillna(1)

     0    1  2
a  1.0  2.0  3
b  1.0  1.0  6
c  1.0  8.0  9

In [82]:
df1.dropna(how="all",axis=1)

     1  2
a  2.0  3
b  NaN  6
c  8.0  9

In [77]:
df1.ix["b", 1]=np.nan

In [80]:
df1

    0    1  2
a NaN  2.0  3
b NaN  NaN  6
c NaN  8.0  9

In [81]:
df1.dropna(axis=1)

   2
a  3
b  6
c  9

In [52]:
df = DataFrame(np.arange(12).reshape((3, 4)), index=list("ABC"), columns=list("abcd"))
df

   a  b   c   d
A  0  1   2   3
B  4  5   6   7
C  8  9  10  11

In [53]:
df.ix[ 1: , :]

   a  b   c   d
B  4  5   6   7
C  8  9  10  11

In [54]:
df.ix["B", "b"]

5